InformationRegisters/РегистрЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>РегистрЦен</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ро_РаботыПоПрайсу</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Лог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>55</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Оборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ро_Оборудование</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/роЗаказНаряд.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>роЗаказНаряд</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РаботаРО</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ро_Оборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОборудования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>33</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнвНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>33</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ро_Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИспытания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеБрака</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>222</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Испытатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Мастер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контролер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыявленныеДефекты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ро_Дефекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ро_Примечания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПримечаниеСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>77</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заключение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ро_Заключения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерАктаДопОбр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>22</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДопОбр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ро_Оборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДопОбр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>55</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзготовленияДопОбр</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДиаметрДопОбр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДавлениеДопОбр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПримечаниеДопОбр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>222</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДопОбр</Name>
					<Comment>0 - Нет; 1- Лубрикатор; 2 - задвижка</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Плательщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСкладаR3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПунктыПогрузки</v8:Type>
						<v8:Type>cfg:CatalogRef.ро_ИдентификаторСкладаЗаказчика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТТНвходящий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>33</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ро_Статусы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокСтатус</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзготовления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогСТК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокОтгрузки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ро_Отгрузка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогОтгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПоступление</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ро_ПриходОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассГерметичности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОборудованиеПримечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>222</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>масса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерАктаДопОбр1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>22</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДопОбр1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ро_Оборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДопОбр1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>55</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзготовленияДопОбр1</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДиаметрДопОбр1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДавлениеДопОбр1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПримечаниеДопОбр1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>222</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОборудованияКор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>33</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнвНомерКор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>33</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПружины</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ро_Пружины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстановочноеДавление</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОборудованиеКор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ро_Оборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Дефектовка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Деталь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДеталиОборудования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дефект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Дефекты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Годен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Реставрация</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изготовление</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Покупка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ро_Работы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/РегистрЦен/Forms/Форма/Ext/Form/Module.bsl
Процедура ОбновитьТблОбр()
	
	Запрос = новый Запрос;
	ЗАпрос.Текст = "
	|ВЫБРАТЬ 
	| 	ЗаказНаряд
	|INTO врТбл
	|FROM  РегистрНакопления.ОстатокРО.остатки Рег
	|
	|UNION ALL
	|
	|ВЫБРАТЬ 
	| 	ЗаказНаряд
	|FROM  РегистрНакопления.РаботаРО.остатки Рег
	|
	|;
	|               ВЫБРАТЬ DISTINCT
	               |	ро_Оборудование.Ссылка КАК Оборудование,
	               |	ро_Оборудование.Диаметр КАК Диаметр,
	               |	ро_Оборудование.Давление КАК Давление,
	               |	ISNULL(спрРАб.ссылка,ISNULL(Рег.Цена,0)) КАК Цена,
	               |	ро_Оборудование.Родитель.Наименование КАК Родитель
	               |ИЗ
	               |	врТбл КАК ОстатокРО
				   
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.роЗаказНаряд КАК роЗаказНаряд
	               |		ПО ОстатокРО.ЗаказНаряд = роЗаказНаряд.Ссылка
				   
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ро_Оборудование КАК ро_Оборудование
	               |		ПО роЗаказНаряд.Оборудование = ро_Оборудование.Ссылка
				   |
				   |    LEFT OUTER JOIN РегистрСведений.РегистрЦен Рег ON Рег.Контрагент   = роЗаказНаряд.Контрагент
				   |                                                    и Рег.Оборудование = роЗаказНаряд.Оборудование
				   |
				   |
				   |    LEFT OUTER JOIN Справочник.ро_РаботыПоПрайсу спрРАб ON спрРАб.ссылка = Рег.Работа
				   |
	               |ГДЕ
	               |	роЗаказНаряд.Контрагент = &Контрагент";
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	
	Тбл =Запрос.Выполнить().Выгрузить();
	Тбл.Сортировать("Родитель,Диаметр,Давление,цена");
	
	текЦена=Неопределено;
	текГрп=Неопределено;
	масНС = Новый Массив;
	текСтк = Неопределено;
	
	пТ = новый ТаблицаЗначений;
	пТ.Колонки.Добавить("цена");
	пТ.Колонки.Добавить("Кол",Новый ОписаниеТипов("Число"));
	
	
	Для а=1 по Тбл.Количество() Цикл
		Стр = Тбл[а-1];
		
		Если Стр.РОдитель<>текГрп Тогда
			 текГрп = Стр.РОдитель;
			 текЦена = Неопределено;
		КонецЕСЛИ;
		
		Если  Стр.цена <>ТекЦена Тогда
			
			Если текСтк<>Неопределено Тогда
				предСтр = ТБл[а-2];
				ЕСли предСтр.Диаметр=Стр.Диаметр и предСтр.Давление=Стр.Давление и текЦена <> Неопределено Тогда
					продолжить;
				КонецЕсли;	
				
				пТ.Свернуть("цена","Кол");
				пТ.Сортировать("Кол desc");
				
				текСтк.Вставить("Цена",пТ[0].Цена);
				текСтк.Вставить("конДиа",предСтр.Диаметр);
				текСтк.Вставить("конДав",предСтр.Давление);
				масНС.Добавить(текСтк);
				
				пТ.Очистить();
			КонецЕсли;
			
			текЦена = Стр.Цена;
			текСтк = Новый Структура("начДиа,начДав,нс,Родитель",Стр.Диаметр,стр.Давление,а-1,Стр.Родитель);
		КонецЕсли;
		
		пСтр = пТ.Добавить();
		пСтр.Цена = Стр.Цена;
		пСтр.Кол = 1;
		
	Конеццикла;
	
	Если текСтк<>Неопределено Тогда
		предСтр = ТБл[а-2];
		
		пТ.Свернуть("цена","Кол");
		пТ.Сортировать("Кол desc");
		
		текСтк.Вставить("Цена",пТ[0].Цена);
		текСтк.Вставить("конДиа",предСтр.Диаметр);
		текСтк.Вставить("конДав",предСтр.Давление);
		текСтк.Вставить("Цена",предСтр.Цена);
		масНС.Добавить(текСтк);
	КонецЕсли;
	
	тблОбр.Загрузить(Тбл);
	
	послНС = тблОбр.Количество();
	Для а=-масНС.Количество() по -1 Цикл
		
		Стк = масНС[-а-1];
		
		
		новСтр = тблОбр.Вставить(Стк.нс);
		новСтр.Оборудование = Стк.РОдитель;
		новСтр.Диаметр  	= ФРМДиаметрДавление("Dy =",Стк.начДиа,Стк.конДИа); 
		новСтр.Давление 	= ФРМДиаметрДавление("Py =",Стк.начДав,Стк.конДав); 
		новСТр.Цена 		= Стк.цена;
		новСтр.БазЦена      = Стк.цена;
		новСТр.индОФр 		= 1;
		
	КонецЦикла;
	
	пЦена=0;
	Для каждого Стр из тблОбр Цикл
		Если стр.индОФр = 1 ТОгда
			пЦена = Стр.БазЦена;
		ИНаче
			Стр.БазЦена = пЦена;
		КонецЕСЛИ;
	Конеццикла;
	
КонецПроцедуры

Функция ФРМДиаметрДавление(рек,нач,кон)
	Если нач=0 и кон=0 ТОгда
		Возврат "";
	КонецЕСЛИ;
	
	Если нач=кон ТОгда
		Возврат Рек+" "+Нач;
	ИНачеЕсли Нач=0 Тогда
		Возврат рек+" меньше "+кон;
	ИНачеЕсли Кон=0 ТОгда
		Возврат рек+" от "+нач+" и более";
	ИНаче
		Возврат рек+" "+Нач+"-"+кон;
	КонецЕСлИ;
	
		
КонецФункции

&НаКлиенте
Процедура ОбновитьТбл(Команда)
	ОбновитьТблОбр();
	ВидимостьКрасныхЦен();
КонецПроцедуры

&НаСервере
Процедура Команда1НаСервере()
	Запрос = новый Запрос;
	Запрос.Текст = "
	            	| SELECT DISTINCT
					| роЗаказНаряд.Контрагент,
					|  роЗаказНаряд.Оборудование
					|INTO врТБл
					|FROM РегистрНакопления.ОстатокРО КАК ОстатокРО
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.роЗаказНаряд КАК роЗаказНаряд
	               |		ПО ОстатокРО.ЗаказНаряд = роЗаказНаряд.Ссылка
					|
					|
					|
					|   ;
	
	
	               |SELECT
				   |    Рег.Контрагент Контрагент,
	               |	Спр.ссылка КАК Оборудование,
				   |    Рег.Цена Цена
	               |ИЗ
	               |	 Справочник.ро_Оборудование Спр 
				   |INNER JOIN врТбл ТБл ON Тбл.Оборудование = Спр.ссылка
				   |INNER JOIN РегистрСведений.Прайс.СрезПоследних Рег ON Рег.Контрагент = Тбл.Контрагент
				   |                                           и Рег.Оборудование  = Спр.родитель 
				   |                                           и (Рег.ДиаметрОт   <= Спр.Диаметр  или Рег.ДиаметрОт = 0)
				   |                                           и (Рег.ДиаметрДо   >= Спр.Диаметр  или Рег.ДиаметрДо = 0)
				   |                                           и (Рег.ДавлениеОт  <= Спр.Давление или Рег.ДавлениеОт = 0)
				   |                                           и (Рег.ДавлениеДо  >= Спр.Давление или Рег.ДавлениеДо = 0)
				   |
				   |WHERE   Спр.ЭтоГРуппа = ложь
				   |
				   |";
	
	
	
	Тбл = Запрос.Выполнить().Выгрузить();
	Наб = РегистрыСведений.РегистрЦен.СоздатьНаборЗаписей();
	Наб.Загрузить(Тбл);
	Наб.Записать();
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	Команда1НаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура тблОбрЦенаПриИзмененииНаСервере(КА,Обр,Цена)
	
	Зап = РегистрыСведений.РегистрЦен.СоздатьМенеджерЗаписи();
	Зап.Контрагент = КА;
	Зап.Оборудование = Обр;
	Если типЗнч(Цена)=Тип("СправочникСсылка.ро_РаботыПоПрайсу") Тогда
		Зап.Работа = Цена;
	Иначе
		Зап.Цена = Цена;
	КонецЕсли;
	ЗАп.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура тблОбрЦенаПриИзменении(Элемент)
	ТекСтр = Элементы.тблОбр.ТекущиеДанные;
	тблОбрЦенаПриИзмененииНаСервере(Контрагент,текСтр.Оборудование,текСтр.Цена);
	ВидимостьКрасныхЦен();
КонецПроцедуры

&НаКлиенте
Процедура КраснаяЦена(Команда)
	
	Если Элементы.тблОбр.ТекущиеДанные=Неопределено Тогда 
		начА=1; 
	ИНаче
		начА = тблОбр.Индекс(Элементы.тблОбр.ТекущиеДанные)+1;
	КонецЕСЛИ;
	
	конА = тблОбр.Количество()-1;
	ДЛя i=1 to 2 DO
		ДЛя а = начА  по конА Цикл
			Если тблОбр[а].цена = 0 и тблОбр[а].индОфр=0 Тогда
				элементы.тблОбр.ТекущаяСтрока= тблОБр[а].ПолучитьИдентификатор();
				прервать;
			КонецЕСЛИ;
		КонецЦикла;
		
		Если а>конА Тогда
			конА = МИН(тблОбр.Количество(),начА);
			начА = 1;
		иначе
			прервать;
		КонецЕСЛИ;
	EndDO;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьКрасныхЦен()
	
	кол=0;
	ДЛя каждого Стр из ТблОбр Цикл
		Если Стр.индОфр = 0 и (Стр.Цена = 0 или Стр.Цена = Неопределено) Тогда
			кол=Кол+1;
		КонецЕСЛИ;
	КонецЦикла;
	
	текстКолКрасныхЦен = "Красных цен - "+кол;
	Элементы.грпКрасныхЦен.Видимость = кол<>0;
	
КонецПроцедуры

&НаКлиенте
Процедура тблОбрВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если  Элементы.тблОбр.ВыделенныеСтроки.Количество()>1 Тогда
		ОткрытьМасВводЦены(Элемент);
		СтандартнаяОбработка = Ложь;
		Возврат; 
	КонецеСЛИ;
	
	
	ТекСтр = Элементы.тблОбр.ТекущиеДанные;
	Если текСтр.индОфр<>0 Тогда 
		СтандартнаяОбработка = Ложь;
		Возврат; 
	КонецЕсли;
	
	Если Поле.имя <> "тблОбрЦена" Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьЗначение(,текСтр.Оборудование);
	КонецеСЛИ;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьМасВводЦены(Команда)
	ТекСтр = Элементы.тблОбр.ТекущиеДанные;
	Стк = Новый Структура;
	Стк.Вставить("Цена",ТекСтр.Цена);
	Стк.Вставить("Контрагент",Контрагент);
	
	оо =Новый ОписаниеОповещения("ОкончаниеВыбораЦены",ЭтотОбъект);
	
	ОткрытьФорму("РегистрСведений.РегистрЦен.Форма.ФормаВыбораЦены",Стк,ЭтаФорма,ЭтаФорма,,,оо,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура  ОкончаниеВыбораЦены(Рез,Параметры) Экспорт
	
	Если Рез = Неопределено Тогда Возврат; КонецЕслИ;
	
	Для каждого Эл из Элементы.тблОбр.ВыделенныеСтроки Цикл
		текСтр = тблОбр.НайтиПоИдентификатору(Эл);	
		Если текСтр.индОфр <> 0 ТОгда Продолжить; КонецЕсли;
		текСтр.Цена = Рез;
		тблОбрЦенаПриИзмененииНаСервере(Контрагент,текСтр.Оборудование,текСтр.Цена);
	КонецЦикла;
	
	ВидимостьКрасныхЦен();
КонецПроцедуры
